/****************************************Copyright (c)*****************************************************
**                               Guangzhou ZHIYUAN electronics Co.,LTD.
**                                      
**                                    http://www.embedtools.com
**
**--------------File Info----------------------------------------------------------------------------------
** File Name:           SST25VF016BDrv.h
** Last modified Date:  2008.02.18
** Last Version:        V1.1
** Descriptions:        SST25VF016B的操作函数
**
**---------------------------------------------------------------------------------------------------------
** Created By:          Litiantian
** Created date:        2007.04.25
** Version:             V1.0
** Descriptions:        First version
**
**---------------------------------------------------------------------------------------------------------
** Modified by:         zhangzheng     
** Modified date:       2008.02.18 
** Version:             V1.1
** Descriptions:        本版本进行了以下修改：
                        (1) 提高写效率 
                        (2) 修改扇区擦除操作的BUG。  
**********************************************************************************************************/

#ifndef __F016BDRV_H 
#define __F016BDRV_H

#include "stdint.h"


typedef enum ERTYPE{Sec1,Sec8,Sec16,Chip} F016bErType;                /*  扇区擦除方式定义             */

enum OptResult{F032BERROR,F032BOK};                                   /*  定义操作结果                 */
                                                                      
#define __F032B_MAX_ADDR    0x3FFFFF     /*  定义芯片内部最大地址(这里最大支持4M) */ 
#define __F032B_SEC_MAX     0x3FF        /*  定义最大扇区号(最大0~1023)     */
#define __F032B_SEC_SIZE    0x1000       /*  扇区大小 */
/**********************************************************************************************************
** Function name:       sstf016bInit 
** Descriptions:        初始化SPI
** input parameters:    None
** output parameters:   None
** Returned value:      None
** Created by:          Litiantian
** Created Date:        2007.04.16
**---------------------------------------------------------------------------------------------------------
** Modified by:         zhangzheng
** Modified date:       2008.02.18
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
extern void Spi_Flash_Configuration (void);
void IRQ_SSP1(void);
/**********************************************************************************************************
** Function name:       sst26vf032b_read
** Descriptions:        SST25VF016B的读函数
** input parameters:    Dst: 目标地址,范围 0x0 - MAX_ADDR（MAX_ADDR = 0x1FFFFF）       
**                      NByte: 要读取的数据字节数
** output parameters:   RcvBufPt:接收缓存的指针
** Returned value:      F032BERROR: 错误; F032BOK: 成功
** Created by:          Litiantian
** Created Date:        2007.04.16
**---------------------------------------------------------------------------------------------------------
** Modified by:         zhangzheng
** Modified date:       2008.02.18
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
extern uint8_t sst26vf032b_read (uint32_t Dst,
                         uint32_t NByte, 
                         volatile uint8_t *RcvBufPt);

/**********************************************************************************************************
** Function name:       sst26vf032b_Jedec_ID_Read 
** Descriptions:        SST25VF016B的读ID函数,可选择读ID 
** input parameters:    IDType: ID类型,用户可在Jedec_ID,Dev_ID,Manu_ID三者里选择
** output parameters:   RcvbufPt: 存储ID变量的指针
** Returned value:      F032BERROR: 错误; F032BOK: 成功
** Created by:          Litiantian
** Created Date:        2007.04.16
**---------------------------------------------------------------------------------------------------------
** Modified by:         zhangzheng
** Modified date:       2008.02.18
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
extern uint8_t sst26vf032b_Jedec_ID_Read (uint32_t *RcvbufPt);


/**********************************************************************************************************
** Function name:       sst26vf032b_write
** Descriptions:        SST25VF016B的写函数，可写1个和多个数据到指定地址
** input parameters:    Dst: 目标地址,范围 0x0 - MAX_ADDR（MAX_ADDR = 0x1FFFFF）       
**                      SndbufPt: 发送缓存区指针
**                      NByte: 要写的数据字节数
** output parameters:   None
** Returned value:      F032BERROR: 错误; F032BOK: 成功
** Created by:          Litiantian
** Created Date:        2007.04.16
**---------------------------------------------------------------------------------------------------------
** Modified by:         zhangzheng
** Modified date:       2008.02.18
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
extern uint8_t sst26vf032b_write (uint32_t Dst,
                         volatile uint8_t *SndbufPt, 
                         uint32_t NByte);

/**********************************************************************************************************
** Function name:       sst26vf032b_erase
** Descriptions:        根据指定的扇区号选取最高效的算法擦除 
** input parameters:    sec1: 起始扇区号,范围(0~511)
**                      sec2: 终止扇区号,范围(0~511)
** output parameters:   None
** Returned value:      F032BERROR: 错误; F032BOK: 成功
** Created by:          Litiantian
** Created Date:        2007.04.16
**---------------------------------------------------------------------------------------------------------
** Modified by:         zhangzheng
** Modified date:       2008.02.18
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
extern uint8_t sst26vf032b_erase (uint32_t sec1, uint32_t sec2);

/**********************************************************************************************************
** Function name:       sstf032b_IsExist 
** Descriptions:        检测SPINorFlash是否存在 
** input parameters:    None
** output parameters:   None
** Returned value:      F032BERROR: 不存在; F032BOK: 存在
** Created by:          zhangzheng
** Created Date:        2008.02.18
**---------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
extern uint8_t sstf032b_IsExist (void);

#endif

/**********************************************************************************************************
  END FILE
**********************************************************************************************************/
